<template>
  <div>
    <main>
      <h1 class="main-h1">Правила</h1>
      <div class="article">
        <img
          src="https://abrakadabra.fun/uploads/posts/2021-12/1638943594_1-abrakadabra-fun-p-banner-dlya-diskorda-anime-itachi-1.jpg"
          alt="rules-img"
          class="rules-img"
        />
      </div>
      <div class="article">
        <h2>Правила поведінки в текстових каналах</h2>
        <ul class="rules">
          <li>
            1. Флуд, спам і будь-який їх різновид. Покарання: мут до 60 хвилин.
            Виняток - <b class="chat">#💌загальний-чат</b>.
          </li>
          <li>
            2. Образи та перехід на особистості. Покарання: мут до 60
            хвилин/варн.
          </li>
          <li>3. Провокація. Покарання: мут до 60 хвилин/варн.</li>
          <li>
            4. Заборонено 18+ контен. Покарання: мут до 60 хвилин/варн. Виняток
            -
            <b class="chat">#🔞</b>.
          </li>
          <li>
            5. Свастика заборонена у будь-якому чаті. Покарання: мут до 60
            хвилин/варн.
          </li>
          <li>
            6. Марна згадка робочих ролей. Покарання: мут до 60 хвилин/варн.
          </li>
          <li>
            7. Неадекватна поведінка у бік Адміністрації, Модерації. Покарання:
            мут до 60 хвилин.
          </li>
        </ul>
      </div>
      <div class="article">
        <h2>Правила поведінки в голосових каналах</h2>
        <ul class="rules">
          <li>
            8. Крики, створення сторонніх шумів, перешкоди спілкуванню.
            Покарання: мут до 10 хвилин/варн.
          </li>
          <li>9. Провокація. Покарання: мут до 60 хвилин/варн.</li>
          <li>10. Неадекватна поведінка. Покарання: мут до 60 хвилин/варн.</li>
          <li>
            11. Використання програм зміни голосу тощо. Покарання: мут до 60
            хвилин/варн.
          </li>
        </ul>
      </div>
      <div class="article">
        <h2>Загальні правила</h2>
        <ul class="rules">
          <li>
            12. Будь-які дії, які можуть стати на заваді розвитку сервера.
            Покарання: мут до 60 хвилин/варн.
          </li>
          <li>13. Реклама сторонніх проектів. Покарання: варн/бан.</li>
          <li>14. Жебрацтво ролей. Покарання: мут до 60 хвилин/варн.</li>
        </ul>
      </div>
      <div class="article">
        <h2>Примітки</h2>
        <ul class="dop-rules">
          <li>Поточні правила можуть змінитися будь-якої миті.</li>
          <li>
            Заборонено після отримання покарання з'ясовувати стосунки з
            адміністрацією.
          </li>
          <li>
            Адміністрація має право відхилятися від норм покарань на свій
            розсуд.
          </li>
          <li>Перед винесенням вироку не виключено людського фактора.</li>
          <li>
            Не виключено, що адміністрація сервера може видати вам усне
            попередження. Усне попередження є ознакою того, що ви обізнані про
            порушене вами правило, і не передбачає міру покарання.
          </li>
          <li>
            Правила, що діють у чаті, також поширюються на назви кімнат та ніки,
            що відображаються на сервері.
          </li>
          <li>
            Неадекватна поведінка - багатосторонні образи, провокування
            конфліктів на гострі теми, образу робочих ролей сервера та окремих
            кімнат.
          </li>
          <li>Ваш обліковий запис і ви відповідаєте за порушення.</li>
          <li>
            Якщо адміністрація вас про щось просить, значить у цьому є
            необхідність!
          </li>
        </ul>
      </div>
      <main-masterpage>
        <template v-slot:footer></template>
      </main-masterpage>
    </main>
  </div>
</template>

<script>
import MainMasterpage from "@/masterpage/MainMasterpage.vue";

export default {
  name: "RulesPage",
  components: {
    MainMasterpage,
  },
  methods: {
    goToMain() {
      this.$router.push({ path: "/main" });
    },
    goToRoles() {
      this.$router.push({ path: "/roles" });
    },
  },
};
</script>

<style lang="scss" scoped>
@import "@/assets/styles/rules";
</style>
